# ParamId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExternalServiceUIData..::..ParamId Property
IFCExternalServiceUIData Class See Also
---
the parameter id
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId ParamId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParamId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ParamId {
	ElementId^ get ();
}
```

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace